app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "article4"], ["text", "fadf"], ["created_at", "2017-10-12 02:50:30.873893"], ["updated_at", "2017-10-12 02:50:30.873893"]]
---
	def create
		@article = Article.new(article_params) #upper case here referring to the model Article

		if @article.save